#define _CRT_SECURE_NO_WARNINGS
#define SIZE 11
#include <stdio.h>
#include <string.h>

int 


/*
מבוא לעקרונות התכנות בשפת C
תרגול 9:  מחרוזות

1.	כתוב פונקציה המקבלת מחרוזת ומחזירה את כמות האותיות הגדולות שבמחרוזת.
2.	כתוב פונקציה המקבלת 2 מחרוזות: הפונקציה מעתיקה את כל האותיות הגדולות מהמחרוזת הראשונה לשניה, ומחזירה את אורך המחרוזת השניה.
3.	כתוב פונקציה המקבלת 2 מחרוזות, מחזירה את כמות המופעים של התווים מהמחרוזת השניה בראשונה.
דוגמא: עבור המחרוזות aabbcdef  ו- abc יוחזר 5 מאחר והתוים abc מופיעים 5 פעמים במחרוזת הראשונה.
	  ואם המחרוזת השנייה הייתה aabc אז כמות המופעים הייתה 7.
4.	כתוב פונקציה המקבלת 2 מחרוזות (ידוע כי הן זהות באורכן). על הפונקציה להחזיר את האינדקס אשר החל ממנו המחרוזות זהות עד הסוף. אם לא קיים אינדקס כזה – תחזיר 1-.
דוגמא: עבור המחרוזות "ccabcqwe"   ו- "ccbnmqwe" יוחזר האינדקס 5, מאחר וממנו הלאה המחרוזות זהות.
5.	כתוב פונקציה אשר מקבלת מחרוזת המכילה משפט (בין מילה למילה מפריד רווח אחד לפחות). הפונקציה תחזיר את מספר המילים במחרוזת.
לקליטת המחרוזת השתמש בgets.
6.	כתוב את הפונקציה אשר מקבלת מחרוזת המכילה מילים (בין מילה למילה קיים רווח אחד בלבד).
void kth_last_word(char const words[], int k, char kth[])
הפונקציה תחזיר את המילה במקום ה-k מהסוף


*/